[
    {
        "text": "The Australian platypus is seemingly a hybrid of a mammal and reptilian creature",
        "expected": {
            "fleschKincaid": 0,
            "gunningFog": 0,
            "colemanLiau": 0,
            "smog": 0,
            "automated": 0,
            "flesch": 0,
            "spache": 0,
            "daleChall": 0
        }
    },
    {
        "text": "One morning Toad sat in bed. “I have many things to do,” he said. “I will write them all down on a list so that I can remember them.” Toad wrote on a piece of paper: A list of things to do today. Then he wrote: Wake up. “I have done that,” said Toad, and he crossed it out.",
        "expected": {
            "fleschKincaid": 1.2,
            "gunningFog": 4.6,
            "colemanLiau": 0.9,
            "smog": 5.5,
            "automated": -0.7,
            "flesch": 103.7,
            "spache": 2.4,
            "daleChall": 0.8
        }
    },
    {
        "text": "You said you didn’t want it,” said Thelma. “And anyhow, I don’t want to sell it now.” “Why not?” said Frances. “Well,” said Thelma, “it is a very good tea set. It is plastic that does not break. It has pretty red flowers on it. It has all the cups and saucers. It has the sugar bowl and the cream pitcher and the teapot. It is almost new, and I think it cost a lot of money.” “I have two dollars and seventeen cents,” said Frances. “That’s a lot of money.” “I don’t know,” said Thelma. “If I sell you…",
        "expected": {
            "fleschKincaid": 1.6,
            "gunningFog": 3.7,
            "colemanLiau": 1.3,
            "smog": 5.3,
            "automated": -0.9,
            "flesch": 96.4,
            "spache": 2.5,
            "daleChall": 1.6
        }
    },
    {
        "text": "Once upon a time a very small witch was walking in the woods. The cold wind was blowing the dry leaves all around her. The little witch was frantically searching for a house for the winter. She could not find one. Suddenly a piece of orange paper, blown by the wind, landed at her feet. She picked it up. The little witch looked closely at the paper and then she said, “I shall make myself a little house from this piece of orange paper.” She folded the paper in half. then she took her scissors (she always carried a pair…",
        "expected": {
            "fleschKincaid": 4.0,
            "gunningFog": 4.8,
            "colemanLiau": 5.6,
            "smog": 5.8,
            "automated": 3.4,
            "flesch": 86.4,
            "spache": 3.2,
            "daleChall": 2.6
        }
    },
    {
        "text": "Seals are wonderful divers. Some seals can dive several hundred feet below the surface. On deep dives, they can stay underwater up to 40 minutes without surfacing to breathe. They have special features to help save oxygen on such dives. When seals dive, they stop breathing. For very deep dives, their blood flow to everything except critical organs stops or slows. Seals can also slow their heart rates, sometimes to one-tenth the rates at the surface. You may wonder how seals avoid the bends on deep dives. The bends are a painful condition. They are caused when nitrogen dissolves in…",
        "expected": {
            "fleschKincaid": 4.9,
            "gunningFog": 8.0,
            "colemanLiau": 9.0,
            "smog": 8.8,
            "automated": 5.8,
            "flesch": 77.4,
            "spache": 3.9,
            "daleChall": 2.5
        }
    },
    {
        "text": "Eskimos of Alaska’s Arctic north coast have hunted whales for centuries. Survival has depended on killing the 80-footlong bowhead whales that swim from the Bering Sea to the ice-clogged Beaufort Sea each Spring. The Eskimos’ entire way of life has been centered around the hunt. But now that way of life is being threatened by America’s need for oil, say many Eskimos who hunt the whales. Huge amounts of oil may be beneath the Beaufort Sea. And oil companies want to begin drilling this spring. However, many Eskimos say severe storms and ice conditions make drilling dangerous…",
        "expected": {
            "fleschKincaid": 7.6,
            "gunningFog": 7.6,
            "colemanLiau": 10.1,
            "smog": 10.9,
            "automated": 8.0,
            "flesch": 65.7,
            "spache": 4.9,
            "daleChall": 4.7
        }
    },
    {
        "text": "Why is it that as soon as “Jingle Bells” starts playing on the radio, otherwise-sane people are driven to extremes to create the Perfect Christmas? Take the case of Maureen McFadden, a Woman’s Day editor, who decided to decorate her tree with homemade gingerbread ornaments. “I started late in the evening,” she recalled. “And then I knocked the molasses jar on the floor.” It was downhill from there. Her cat—long haired , of course— sat in the molasses pool. “And when I yelped, he ran down the hall into my bedroom spewing molasses everywhere.” Still, after she washed the ….",
        "expected": {
            "fleschKincaid": 6.4,
            "gunningFog": 9.0,
            "colemanLiau": 8.4,
            "smog": 9.8,
            "automated": 6.1,
            "flesch": 71.5,
            "spache": 4.6,
            "daleChall": 4.7
        }
    },
    {
        "text": "The controversy over the laser-armed satellite boils down to two related questions: Will it be technically effective? And should the United States make a massive effort to deploy it? To its backers, the laser seems the perfect weapon. Traveling in a straight line at 186,000 miles per second, a laser beam is tens of thousands of times as fast as any bullet or rocket. It could strike its target with a power of many watts per square inch. The resulting heat, combined with a mechanical shock wave created by recoil as surface layers were blasted away, could quickly melt…",
        "expected": {
            "fleschKincaid": 8.5,
            "gunningFog": 9.8,
            "colemanLiau": 9.4,
            "smog": 10.5,
            "automated": 8.5,
            "flesch": 63.6,
            "spache": 5.7,
            "daleChall": 5.3
        }
    },
    {
        "text": "The latest finding is a refinement of evidence presented last summer by audio expert James Barger—who testified there was a 50 percent probability that four shots were heard on the tape. Barger had recorded test firings at various points in the Dealey Plaza, then compared them with the motorcycle recording. The greatest similarity was produced by two shots from the book depository, one from the knoll and another from the depository. But Barger did not draw firm conclusions because he could not pinpoint the policeman’s motorcycle; his estimate could have been 18 feet off in any direction. Weiss, whose…",
        "expected": {
            "fleschKincaid": 11.8,
            "gunningFog": 15.6,
            "colemanLiau": 12.4,
            "smog": 14.3,
            "automated": 12.2,
            "flesch": 45.4,
            "spache": 5.9,
            "daleChall": 6.5
        }
    },
    {
        "text": "Until the 1940’s, there were no specific psychiatric drugs. Bromides, barbiturates, and opiates were known to sedate disturbed patients but did not reverse the symptoms of severe mental illnesses such as the schizophrenias or manic-depressive psychoses. They did ameliorate anxiety, but only at the cost of fogging the minds of the recipients, who had to decide between being unhappy and being intoxicated. In the 1950’s, the first specific drug appeared: chlorpromazine (trade name Thorazine). It was synthesized when an antihistamine chemical relative was found to sedate surgical patients. However, clinical observations showed that this drug did much more than simply…",
        "expected": {
            "fleschKincaid": 12.2,
            "gunningFog": 15.4,
            "colemanLiau": 14.2,
            "smog": 14.6,
            "automated": 12.4,
            "flesch": 37.3,
            "spache": 5.9,
            "daleChall": 7.1
        }
    },
    {
        "text": "Further support for the view that educational expansion would reduce inequality was derived from the dualistic nature of developing societies. The economic structures of developing societies were said to consist of two sectors: a traditional sector that uses little capital, is relatively unproductive, does not require an educated labor force, and places a great emphasis on subsistence farming, small workshops and small commercial enterprises; and a modern sector that uses advanced technology and capital, is far more productive, and requires a labor force with at least some schooling. Expanding the educational system would qualify more workers for jobs where demands…",
        "expected": {
            "fleschKincaid": 19.9,
            "gunningFog": 22.5,
            "colemanLiau": 16.5,
            "smog": 19.3,
            "automated": 21.8,
            "flesch": 11.4,
            "spache": 8.0,
            "daleChall": 8.4
        }
    }
]